MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/NUC220LE3AE/mcu.h
/**************************************************************************//**
 * @file     NUC200Series.h
 * @version  V3.0
 * $Revision: 75 $
 * $Date: 17/05/26 10:58a $
 * @brief    NUC200 Series Peripheral Access Layer Header File
 *
 * @note
 * @copyright SPDX-License-Identifier: Apache-2.0
 * @copyright Copyright (C) 2014 Nuvoton Technology Corp. All rights reserved.
 ******************************************************************************/



/**
  \mainpage Introduction
  *
  *
  * This user manual describes the usage of NUC200 Series MCU device driver
  *
  * <b>Disclaimer</b>
  *
  * The Software is furnished "AS IS", without warranty as to performance or results, and
  * the entire risk as to performance or results is assumed by YOU. Nuvoton disclaims all
  * warranties, express, implied or otherwise, with regard to the Software, its use, or
  * operation, including without limitation any and all warranties of merchantability, fitness
  * for a particular purpose, and non-infringement of intellectual property rights.
  *
  * <b>Copyright Notice</b>
  *
  * Copyright (C) 2014~2024 Nuvoton Technology Corp. All rights reserved.
  */

#ifndef __NUC200Series_H__
#define __NUC200Series_H__

/*
 * ==========================================================================
 * ---------- Interrupt Number Definition -----------------------------------
 * ==========================================================================
*/

/** @addtogroup CMSIS Device Definitions for CMSIS
  Interrupt Number Definition and Configurations for CMSIS
  @{
*/

/**
 * @details  Interrupt Number Definition. The maximum of 32 Specific Interrupts are possible.
 */

typedef enum IRQn
{
    /******  Cortex-M0 Processor Exceptions Numbers ***************************************************/
    NonMaskableInt_IRQn         = -14,    /*!< Non Maskable Interrupt                                 */
    HardFault_IRQn              = -13,    /*!< Cortex-M0 Hard Fault Interrupt                         */
    SVCall_IRQn                 = -5,     /*!< Cortex-M0 SV Call Interrupt                            */
    PendSV_IRQn                 = -2,     /*!< Cortex-M0 Pend SV Interrupt                            */
    SysTick_IRQn                = -1,     /*!< Cortex-M0 System Tick Interrupt                        */

    /******  ARMIKMCU Swift specific Interrupt Numbers ************************************************/
    BOD_IRQn                  = 0,        /*!< Brown-Out Low Voltage Detected Interrupt               */
    WDT_IRQn                  = 1,        /*!< Watch Dog Timer Interrupt                              */
    EINT0_IRQn                = 2,        /*!< EINT0 Interrupt                                        */
    EINT1_IRQn                = 3,        /*!< EINT1 Interrupt                                        */
    GPAB_IRQn                 = 4,        /*!< GPIO_PA/PB Interrupt                                   */
    GPCDEF_IRQn               = 5,        /*!< GPIO_PC/PD/PE/PF Interrupt                             */
    PWMA_IRQn                 = 6,        /*!< PWMA Interrupt                                         */
    PWMB_IRQn                 = 7,        /*!< PWMB Interrupt                                         */
    TMR0_IRQn                 = 8,        /*!< TIMER0 Interrupt                                       */
    TMR1_IRQn                 = 9,        /*!< TIMER1 Interrupt                                       */
    TMR2_IRQn                 = 10,       /*!< TIMER2 Interrupt                                       */
    TMR3_IRQn                 = 11,       /*!< TIMER3 Interrupt                                       */
    UART02_IRQn               = 12,       /*!< UART0/UART2 Interrupt                                  */
    UART1_IRQn                = 13,       /*!< UART1 Interrupt                                        */
    SPI0_IRQn                 = 14,       /*!< SPI0 Interrupt                                         */
    SPI1_IRQn                 = 15,       /*!< SPI1 Interrupt                                         */
    SPI2_IRQn                 = 16,       /*!< SPI2 Interrupt                                         */
    SPI3_IRQn                 = 17,       /*!< SPI3 Interrupt                                         */
    I2C0_IRQn                 = 18,       /*!< I2C0 Interrupt                                         */
    I2C1_IRQn                 = 19,       /*!< I2C1 Interrupt                                         */
    CAN0_IRQn                 = 20,       /*!< CAN0 Interrupt                                         */
    CAN1_IRQn                 = 21,       /*!< CAN1 Interrupt                                         */
    SC012_IRQn                = 22,       /*!< SC0/SC1/SC2 Interrupt                                  */
    USBD_IRQn                 = 23,       /*!< USB device Interrupt                                   */
    PS2_IRQn                  = 24,       /*!< PS/2 device Interrupt                                  */
    ACMP_IRQn                 = 25,       /*!< ACMP0 Interrupt                                        */
    PDMA_IRQn                 = 26,       /*!< PDMA Interrupt                                         */
    I2S_IRQn                  = 27,       /*!< I2S Interrupt                                          */
    PWRWU_IRQn                = 28,       /*!< Power Down Wake Up Interrupt                           */
    ADC_IRQn                  = 29,       /*!< ADC Interrupt                                          */
    IRC_IRQn                  = 30,       /*!< IRC TRIM Interrupt                                     */
    RTC_IRQn                  = 31        /*!< RTC Interrupt                                          */
} IRQn_Type;


/*
 * ==========================================================================
 * ----------- Processor and Core Peripheral Section ------------------------
 * ==========================================================================
 */

/* Configuration of the Cortex-M0 Processor and Core Peripherals */
#define __MPU_PRESENT           0       /*!< armikcmu does not provide a MPU present or not       */
#define __NVIC_PRIO_BITS        2       /*!< armikcmu Supports 2 Bits for the Priority Levels     */
#define __Vendor_SysTickConfig  0       /*!< Set to 1 if different SysTick Config is used         */
#define __FPU_PRESENT           0
#define __SOFTFP__ // Note: Added for MikroE implementation.
#ifndef __SOFTFP__
# define __SOFTFP__             1
#endif


/*@}*/ /* end of group CMSIS */


#include "core_cm0.h"                   /* Cortex-M0 processor and core peripherals               */
// Note: Changed for MikroE implementation.
//#include "system_NUC200Series.h"        /* NUC200 System                                          */
#define __I volatile // Note: Added for MikroE implementation.
#define __O __I // Note: Added for MikroE implementation.
#define __IO __I // Note: Added for MikroE implementation.
#include <stdint.h>

#if defined ( __CC_ARM   )
#pragma anon_unions
#endif


/*-------------------------------- Device Specific Peripheral registers structures ---------------------*/
/** @addtogroup REGISTER Control Register
  Peripheral Control Registers
  @{
 */

/*---------------------- Analog Comparator Controller -------------------------*/
/**
    @addtogroup ACMP Analog Comparator Controller (ACMP)
    Memory Mapped Structure for ACMP Controller
@{ */



typedef struct
{


/**
 * @var ACMP_T::CMPCR
 * Offset: 0x00  Analog Comparator 0 Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |CMPEN     |Comparator Enable
 * |        |          |0 = Disabled.
 * |        |          |1 = Enabled.
 * |[1]     |CMPIE     |Comparator Interrupt Enable
 * |        |          |0 = Interrupt function
 * |        |          |Disabled.
 * |        |          |1 = Interrupt function
 * |        |          |Enabled.
 * |[2]     |CMP_HYSEN |Comparator Hysteresis Enable
 * |        |          |0 = Hysteresis function Disabled (Default).
 * |        |          |1 = Hysteresis function
 * |        |          |Enabled.
 * |[4]     |CMPCN     |Comparator Negative Input Selection
 * |        |          |0 = The source of the negative comparator input is from ACMPn_N pin (n = 0, 1).
 * |        |          |1 = Internal band-gap reference voltage is selected as the source
 * |        |          |    of negative comparator input.

